In [2]:
person1 = {
    'first': ['Kelvin','John', 'Shen'],
    'last': ['Jinn', 'Dave', 'Lee'],
    'email': ['example1@gmail.com', 'example2@gmail.com', 'example3@gmail.com']
}

In [3]:
import pandas as pd

In [4]:
result = pd.DataFrame(person1)

In [5]:
result

    first  last               email
0  Kelvin  Jinn  example1@gmail.com
1    John  Dave  example2@gmail.com
2    Shen   Lee  example3@gmail.com

In [6]:
result[['last', 'email']]

   last               email
0  Jinn  example1@gmail.com
1  Dave  example2@gmail.com
2   Lee  example3@gmail.com

In [7]:
#iloc=index location
result.iloc[[0,1,2],2]

0    example1@gmail.com
1    example2@gmail.com
2    example3@gmail.com
Name: email, dtype: object

In [8]:
result.loc[[0,1,2], ['email', 'last']]

                email  last
0  example1@gmail.com  Jinn
1  example2@gmail.com  Dave
2  example3@gmail.com   Lee

In [9]:
#result.set_index('email', inplace=True)
#result.loc['example1@gmail.com', 'first']
#output: 'Kelvin'

In [10]:
result.iloc[0]

first                Kelvin
last                   Jinn
email    example1@gmail.com
Name: 0, dtype: object

In [11]:
#filtering
filt = (result['last'] == 'Jinn') & (result['first'] == 'Kelvin')
result.loc[filt, 'email']

0    example1@gmail.com
Name: email, dtype: object

In [12]:
#using opposite of 'filt'
result.loc[-filt, 'email']

1    example2@gmail.com
2    example3@gmail.com
Name: email, dtype: object

In [13]:
result.columns

Index(['first', 'last', 'email'], dtype='object')

In [14]:
result.columns= [x.upper() for x in result.columns]
result

    FIRST  LAST               EMAIL
0  Kelvin  Jinn  example1@gmail.com
1    John  Dave  example2@gmail.com
2    Shen   Lee  example3@gmail.com

In [15]:
result.columns =['first name', 'last name', 'email']
result

  first name last name               email
0     Kelvin      Jinn  example1@gmail.com
1       John      Dave  example2@gmail.com
2       Shen       Lee  example3@gmail.com

In [16]:
result.columns = result.columns.str.replace(' ', '_')
result

  first_name last_name               email
0     Kelvin      Jinn  example1@gmail.com
1       John      Dave  example2@gmail.com
2       Shen       Lee  example3@gmail.com

In [17]:
result.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)
result

    first  last               email
0  Kelvin  Jinn  example1@gmail.com
1    John  Dave  example2@gmail.com
2    Shen   Lee  example3@gmail.com

In [18]:
result.loc[2] = ['John', 'Smith', 'newemail@gmail.com']
result

    first   last               email
0  Kelvin   Jinn  example1@gmail.com
1    John   Dave  example2@gmail.com
2    John  Smith  newemail@gmail.com

In [19]:
#modifying specific area
result.loc[2, 'last'] = 'Doe'
result

    first  last               email
0  Kelvin  Jinn  example1@gmail.com
1    John  Dave  example2@gmail.com
2    John   Doe  newemail@gmail.com

In [20]:
result['full_name'] = result['first'] + ' '+ result['last']
result

    first  last               email    full_name
0  Kelvin  Jinn  example1@gmail.com  Kelvin Jinn
1    John  Dave  example2@gmail.com    John Dave
2    John   Doe  newemail@gmail.com     John Doe

In [25]:
result.drop(columns=['first','last'], inplace=True)
result

                email    full_name
0  example1@gmail.com  Kelvin Jinn
1  example2@gmail.com    John Dave
2  newemail@gmail.com     John Doe

In [26]:
#to split up the full_name again
result['full_name'].str.split(' ', expand=True)

        0     1
0  Kelvin  Jinn
1    John  Dave
2    John   Doe

In [28]:
result[['first','last']]=  result['full_name'].str.split(' ', expand=True)
result

                email    full_name   first  last
0  example1@gmail.com  Kelvin Jinn  Kelvin  Jinn
1  example2@gmail.com    John Dave    John  Dave
2  newemail@gmail.com     John Doe    John   Doe